{
    "book": [
        {
        "author": "Sebastian Anthony",
        "source": "www.extremetech.com",
        "title": "Tesla’s Model S now has a titanium underbody shield to reduce risk of battery fires to ‘virtually zero’",
        "wordcount": 508,
        "text": "Elon Musk, responding to the only perceived weakness of the Model S — incendiary and explosive lithium-ion batteries — has     announced that all cars produced after March 6 will have three new underbody shields, made of aluminium and titanium. All existing Model S sedans are eligible for a free retrofit — just phone your local dealer. Musk says that, while the Model S is already by far the safest car on the road, these new shields will reduce the risk of the car’s batteries being pierced by sharp/heavy road debris to “virtually zero.” Back in 2013, after a completely flawless safety record, two Model S sedans were involved in “extremely unusual” collisions. In both cases, the car’s lithium-ion battery pack — which spans most of the car’s underbody — was pierced by a sharp or heavy object. When a lithium-ion battery (LIB) is pierced, the lithium usually reacts with air, causing a fire or explosion. The Model S’s battery pack is divided into 16 compartments, each with a firewall, to minimize the chance of a rapidly growing fire or explosion. In both crashes, the fires developed slowly enough that the cars’ occupants got out and walked away before there was any risk of them being burnt alive. “Even if the occupants had remained in the vehicle and the fire department had not arrived, they would still have been safely protected by the steel and ceramic firewall between the battery pack and the passenger compartment,” Musk said. Even if the Model S is the safest car on the road, those two two fires (thanks in part to the media’s love affair with all things Musk) obviously dented the car’s perceived safety. The first fire was such a wake-up call that Tesla’s market value actually plummeted by $4 billion (but it quickly recovered). Thus, wanting to retain its crown as the automotive industry’s wunderkind, Tesla has announced that it’s adding three new shields to the underbody of the Model S. The first defensive measure is a hollow aluminium bar that deflects objects, or to force self-stabilizing objects (such as tow balls) up into the front trunk liner, before it reaches the battery pack. The second is a titanium plate near the front of the underbody that, other than protecting the car’s sensitive parts, simply obliterates anything that it comes into contact with. Finally, there’s a solid piece of aluminium that absorbs the impact, deflects debris — or, in the case of immovable and incompressible obstacles, causes the car to ramp up over it. All told, these new shields reduce the chance of the Model S’s batteries being pierced to “virtually zero.“ The shields do add some additional weight, which impact range by 0.1%, but ride and handling are unaffected. Musk ends his blog post by reiterating that the shields aren’t really necessary, and that the Model S is already the safest car on the road “with a track record of zero deaths or serious, permanent injuries” but as long as they go some way to “addressing any lingering public misperception about electric vehicle safety,” he’s happy."     
    },

    {
        "author": " Joshua Keating",
        "source": "www.slate.com",
        "title": "Why We Fight (Over Land)",
        "wordcount": 958,
        "text": "From the outside, it’s hard to see how the annexation of Crimea was a rational decision for Russia. As yesterday’s vote in the U.N. General Assembly showed, Moscow is now more politically isolated than ever. Its economy is paying a steep price thanks to harsh sanctions and tumbling markets. Moscow now has responsibility for yet another autonomous unrecognized region of questionable strategic importance—one that just happens to depend on Ukraine for its power and water. Then again, when it comes to territory, states often behave in ways that seem illogical to outsiders. Why is public opinion in South Korea, China, and Japan so inflamed by the question of who owns a series of uninhabited rocks? Why does Israel continually subject itself to international opprobrium by constructing new settlements in the West Bank? In the most recent issue of the journal International Security, Monica Duffy-Doft and Dominic Johnson, political scientists at Oxford, argue that a new theoretical framework is needed to analyze such behavior, one rooted in evolutionary biology. As Duffy-Toft told me an interview today, “It comes back to survival and reproduction. There’s an instinct that we need land in order to exist. We need to have the capacity to get resources to live our lives.” But as she points out, territorial behavior need not always lead to violence. “It’s to our advantage to have borders, to delineate them and understand the basis of who lives where,” she said. “[The model] may explain why it is that states go after territories that have no material basis, or that the costs are higher than what they will get out of them.” Generally speaking, when opponents enter into conflicts—whether birds fighting over a nesting site or states going to war over a border dispute—the actor that previously occupied the territory has an advantage. “If somebody’s a resident, they seem to fight harder. They’re much more apt to be aggressive,” Duffy-Toft says. “As residents, they know the feel of it and the smell and where to find food, but if they come to the conclusion that they don’t have the capacity to defend that territory, they will abandon it.” A version of this dynamic played out in Ukraine. Even though Crimea was part of Ukraine,  local sentiment and ground conditions were favorable to Russia, and it was clear that Kiev didn’t have the means to challenge Russia’s territorial aggression. So Putin’s move went unchallenged, and the territory—in terms of de facto control if not international recognition—changed hands without much bloodshed. Duffy-Toft acknowledges that the thesis is controversial. While their piece is currently the lead article in International Security, one of the more prestigious journals in the field, it took almost 10 years to get it published.  “We’re pushing up against real biases in our field,” she says. “Scholars don’t want to admit that our behavior can be constrained by the fact that we’re animals. They say we’ve developed norms in place to mitigate against that. That’s true, but let’s look at where those institutions came from.” Fighting over territory may be a fundamental biological impulse, but it’s become much rarer, particularly since World War II. This is part of the argument the United States has used to make the case that Russia’s actions are beyond the pale for a modern state. “You just don't in the 21st century behave in 19th-century fashion, said John Kerry. The United States does not view Europe as a battleground between East and West”, said President Obama, nor do we see the situation in Ukraine as a zero-sum game. That’s the kind of thinking that should have ended with the Cold War. (This is also key to the controversial distinction Obama drew this week between the Iraq war and the invasion of Crimea. Whatever actions the United States may have taken in Iraq, in Obama’s view, the country’s sovereignty was not violated as Iraq’s borders never changed.). Part of the reason why territorial wars are now rare may be that the killing capacity of states has increased so much due to improvements in weaponry, particularly nuclear weapons. The costs of challenging a state’s residency in a given territory is now so high that few countries are willing to try it, and international norms have been developed to preserve the current status quo. This has left us with a situation in which basically every piece of land on the Earth is recognized as part of one state or another and borders are rarely challenged—or at least rarely challenged by force. “There’s a recognition that warfare is a lot more costly today,” Duffy-Toft said. “Preserving [the existing] boundaries is recognition that this equilibrium is the best all-around.” The small exceptions to that rule—contested territories like the West Bank or Kashmir, breakaway states like Abkhazia or Somaliland—are where fights over territory are most likely to occur. Ukraine’s residency was weak enough in Crimea that Putin was able to take it without a fight, but that’s not the case in eastern Ukraine, where Kiev’s claim to the territory is much stronger.  An evolutionary model suggests the Ukrainians would feel compelled to fight back if Russia challenged their hold over this territory. Duffy-Toft, currently attending a conference of the International Studies Association in Toronto, noted that in addition to her paper finally being published, “territoriality has made a comeback” in the world of international relations scholarship. Though the conference was planned before the invasion of Crimea, “there’s a lot of interest this year in questions about human attachment to land, territory, and identity. This could be a sign, as some are now arguing, that an older model of geopolitics is making a comeback. As Duffy-Toft put it, \"people are going back to fundamentals.\""
    },

    {
        "author": "Greg Stobart", 
        "title": "How Man City has left Arsenal and Wenger trailing in its wake",
        "source": "www.goal.com",
        "wordcount": 961,
        "text": "Arsene Wenger has never attempted to hide his resentment about the ‘financial doping’ he believes has skewed the odds in favor of Arsenal's major rivals over the last decade. The oil fueled spending of Chelsea and Manchester City has changed the landscape of the Premier League and in the process turned Arsenal from a title contender to a perennial also-ran. Wenger accepted after the midweek draw with Swansea that Arsenal’s title hopes are over, declaring that the title would be won by ‘unstoppable’ City or Chelsea. The Frenchman now has to focus on ensuring Arsenal qualifies for the Champions League for a 17th consecutive year and must justify his side's overwhelming status as the favorite to lift the FA Cup, ending a nine-year wait for a trophy. The next week will be pivotal. On Saturday, the Gunners face Manchester City at the Emirates Stadium before they travel to fifth placed Everton next Sunday. It must feel like Groundhog Day for Arsenal supporters. The last few years have been played on repeat: faint hope of a title challenge, settle for a top four finish, crash out of the Champions League in the early knockout stages. The move to the Emirates Stadium was supposed to fire Arsenal into Europe’s elite, but the club didn’t count on foreign billionaires turning up and blowing it out of the water with million pound missiles. Wenger carefully steered Arsenal through the transition from Highbury to the Emirates, but on the other side found that the situation was no different. The club’s bank accounts grew thanks to weekly sellouts but the team couldn’t afford the transfer fees and wages to compete with Chelsea and City. Professional football is about winning and balancing the budget. That's the basic rule and one I fought for at Arsenal, said Wenger in 2010. At Arsenal we live only with the money we produce, continued Wenger. What I fight for is to live within the resources we produce and to pay the players according to our real potential. It could have been so different for Wenger had Roman Abramovich and Sheikh Mansour not been able to ignore economic realities to catapult their teams into the big time. Arsenal has felt that more keenly than any other club. Not only are the Gunners stuck in the inertia of an annual third or fourth placed finish, but the shift in power was embodied by the fact they lost key players to rivals. Ashley Cole moved to Chelsea before Kolo Toure, Emmanuel Adebayor, Gael Clichy and Samir Nasri all left Arsenal for the Etihad Stadium. Bacary Sagna could well be the latest man to walk that well trodden path. The fact that Arsenal was unable to convince Nasri, in particular, to sign a new contract summed up the state of play. The Frenchman was mocked and accused of money-grabbing by Arsenal fans, but he won the title in his first season in Manchester and has become a pivotal player under Manuel Pellegrini and on current form would walk back into his former side's midfield. Arsenal supporters are now once again voicing their frustration with Wenger, especially after the humiliating 6-0 defeat at Chelsea last week. Once a revolutionary, the 64-year-old increasingly looks like he has been left behind and has no idea how to catch up. Wenger has agreed a two-year contract extension to remain at Arsenal beyond this season, but it is clear that the Gunners have fallen behind City in almost every aspect of the club. For all Wenger’s complaints about City’s investment in players, he himself has changed his strategy in recent years. Project youth was abandoned in pursuit of more immediate success with ready-made signings like Mikel Arteta, Lukas Podolski, Santi Cazorla and Mesut Ozil. Arsenal has the financial capacity to attract top players - Wenger keeps telling us that - but even then the club’s transfer policy feels like an easy excuse behind which to hide. City has deployed a continental structure with Ferran Soriano as chief executive and Txiki Begiristain as director of football, while the Etihad Campus will be the most impressive training center and Academy in world sport. What progress is Arsenal making? Is there no-one Wenger can bring in to help with recruiting players? How does Arsenal find itself dealing with a huge injury crisis every spring?  It seems he is too stubborn to address some of the major issues. While once he could rely on his ability to spot a young player, rivals have caught up with their sophisticated scouting systems. Wenger may not even have the old magic when he comes to spotting talent if the Yaya Toure example is anything to go by. The Ivorian was once on trial at Arsenal; on Saturday there is every chance he will end any faint hope that the Gunners could still win the league. Paul Scholes’ assessment of Arsenal on Sky Sports on Tuesday night became an internet hit largely because few could disagree with his assessment of the lack of leadership in the squad and the lack of progress of players such as Jack Wilshere. On Saturday, an Arsenal legend, one of the club's greatest leaders, will be among the City delegation at the Emirates. It is outrageous that Wenger saw no role for Patrick Vieira at Arsenal and the former Gunners captain is now using his vast experience, his leadership and his winning mentality to coach City’s reserves. Arsenal and Wenger have simply been left behind by richer and more progressive rivals. The excuse about financial doping is wearing thin, especially when the club is on course for an annual turnover of more than 290 million euros this year. Wenger just needs to finally show a willingness to adapt or Arsenal will never catch up."
    },

    {
        "author": "Sebastian Anthony",
        "title": "Ubuntu 14.04 final beta download: A much-needed upgrade for LTS users",
        "source": "www.extremetech.com",
        "wordcount": 480,
        "text": "The next version of the world’s preeminent Linux distro, Ubuntu 14.04 LTS, is almost upon us. Late last night, the final beta of 14.04 Trusty Tahr (an African wild goat) was released, with the final build due on April 17. Trusty Tahr is the first long-term support (LTS) build of Ubuntu in two years, and is thus contains a lot of exciting features that thousands (millions?) of Ubuntu 12.04 users can’t wait to get their hands on. Because Trusty is an LTS, most of the changes are fairly conservative in nature. Unity 7 is still there. Mir, the new graphics stack being developed by Canonical that is due to eventually replace the X Window System, is still a long way off. Despite Canonical’s Shuttleworth saying that Ubuntu 14.04 would include the Touch/Mobile, it appears they won’t make it into the final build. (Canonical has revised its estimate for the first Ubuntu smartphones to the third quarter of 2014, so there’s still a little time to polish things up.) For the big changes, you’ll be waiting for Ubuntu 14.10 (or likely even later for Mir). (Read: Ubuntu: Wake up and smell the Unity against you). So, what is new in Ubuntu 14.04? There is finally the option for locally integrated menus (LIM) in an app’s title bar, instead of forcing the app’s menu to appear at the top of the screen (enable it in the new Unity Control Center). There’s a new Unity lock screen. You now have the option of minimizing apps from the launcher (and launcher icons can be made much smaller, too). Windows are now completely borderless, rather than bounded by a one-pixel black line. The shift from Compiz to GTK3 means window corners are now antialiased — oh, and resizing windows in Ubuntu 14.04 now occurs in real time. Moving down the list of importance: Ubuntu 14.04 also improves support for high-resolution displays, TRIM is enabled by default for Intel and Samsung SSDs, Nvidia Optimus support is improved, and you can pump the system volume up above 100%. All of the default applications have been updated to their latest stable versions (Firefox 28, LibreOffice 4.2.3, Nautilus 3.10.1, etc.), and it rocks Linux kernel 3.13. Overall, Ubuntu 14.04 is a surprisingly pleasant operating system. It feels very polished, especially for a Linux distro. If you’ve been using 12.04 for the last couple of years, 14.04 will feel like a sizable step up. The question, though, is whether Canonical should even be putting much time into desktop builds of Ubuntu — the desktop PC is undoubtedly on its way out, and I’m not entirely sure what role Canonical can play on other form factors. It might be able to gain some traction on TVs, but I’m fairly certain that mobile has already been sewn up tight by Android (also a Linux distro) and iOS. (I’m looking at you too, Firefox OS)."

    }
    ]
}